// MNS 5217:2012 Latin to Cyrillic mapping
export const latinToCyrillicMap: Record<string, string> = {
  'ai': 'ай', 'ei': 'эй', 'ii': 'ий', 'oi': 'ой', 'ui': 'уй',
  'a': 'а', 'b': 'б', 'v': 'в', 'g': 'г', 'd': 'д',
  'e': 'э', 'yo': 'ё', 'j': 'ж', 'z': 'з', 'i': 'и',
  'y': 'й', 'k': 'к', 'l': 'л', 'm': 'м', 'n': 'н',
  'o': 'о', 'ö': 'ө', 'p': 'п', 'r': 'р', 's': 'с',
  't': 'т', 'u': 'у', 'ü': 'ү', 'f': 'ф', 'kh': 'х',
  'ts': 'ц', 'ch': 'ч', 'sh': 'ш', 'shch': 'щ', 'ye': 'е',
  'yu': 'ю', 'ya': 'я', "'": 'ь', '"': 'ъ'
};

// Cyrillic to Latin mapping
export const cyrillicToLatinMap: Record<string, string> = {
  'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
  'е': 'ye', 'ё': 'yo', 'ж': 'j', 'з': 'z', 'и': 'i',
  'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
  'о': 'o', 'ө': 'ö', 'п': 'p', 'р': 'r', 'с': 's',
  'т': 't', 'у': 'u', 'ү': 'ü', 'ф': 'f', 'х': 'kh',
  'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'shch', 'ъ': '"',
  'ы': 'y', 'ь': "'", 'э': 'e', 'ю': 'yu', 'я': 'ya',
  'ай': 'ai', 'эй': 'ei', 'ий': 'ii', 'ой': 'oi', 'уй': 'ui'
};
